// JavaScript Document

//二星组选和值号码和注数对应数组
//下标为号码，值为对应注数
var zhs_exzxhz = new Array(1,1,2,2,3,3,4,4,5,5,5,4,4,3,3,2,2,1,1);

//三星组选和值
var zhs_ex3xzxhz = new Array(1,1,2,3,4,5,7,8,10,12,13,14,15,15,15,15,14,13,12,10,8,7,5,4,3,2,1,1);

//三星直选和值
var zhs_ex3xhz = new Array(1,3,6,10,15,21,28,36,45,55,63,69,73,75,75,73,69,63,55,45,36,28,21,15,10,6,3,1);

//二星直选和值
var zhs_ex2xcxhz= new Array(1,2,3,4,5,6,7,8,9,10,9,8,7,6,5,4,3,2,1);

//三星组三和值
var zhs_ex3xz3hz= new Array(0,1,2,1,3,3,3,4,5,4,5,5,4,5,5,4,5,5,4,5,4,3,3,3,1,2,1,0);

//三星组六和值
var zhs_ex3xz6hz= new Array(0,0,0,1,1,2,3,4,5,7,8,9,10,10,10,10,9,8,7,5,4,3,2,1,1,0,0,0);